In [5]:
import pandas as pd


business_results =pd.Series({"carne":4200,
                  "huevos":4800,
                  "jamon":5400,
                  "lechuga":2200,
                  "avena":1500,
                  "pescado":4000,
                  "tomate":1000,
                  "cebolla":800,
                  "cereal":2200
                  })
print(business_results)



business_results_frame= pd.DataFrame({"enero":[2000,1000,1200,3000,2000],
                  "febrero":[2300,1200,1300,4000,1450],
                  "marzo":[2400,1600,1400,3200,1890],
                  "abril":[1000,600,600,900,1000]},index=['carne','huevos','jamon','lechuga','avena'])
business_results_frame




business_results_frame= pd.DataFrame({"enero":[2000,1000,1200,3000,2000],
                  "marzo":[2400,1600,1400,3200,1890],
                  },index=['carne','huevos','jamon','lechuga','avena'])
business_results_frame

carne      4200
huevos     4800
jamon      5400
lechuga    2200
avena      1500
pescado    4000
tomate     1000
cebolla     800
cereal     2200
dtype: int64

         enero  marzo
carne     2000   2400
huevos    1000   1600
jamon     1200   1400
lechuga   3000   3200
avena     2000   1890

In [6]:
business_results_frame= pd.DataFrame({"enero":[2000,1000,1200,3000,2000],
                  "febrero":[2300,1200,1300,4000,1450],
                  "marzo":[2400,1600,1400,3200,1890],
                  "abril":[1000,600,600,900,1000]},index=['carne','huevos','jamon','lechuga','avena'])
business_results_frame

         enero  febrero  marzo  abril
carne     2000     2300   2400   1000
huevos    1000     1200   1600    600
jamon     1200     1300   1400    600
lechuga   3000     4000   3200    900
avena     2000     1450   1890   1000

In [7]:
business_results_frame= pd.DataFrame({
                  "abril":[1000,600,600,900,1000]},index=['carne','huevos','jamon','lechuga','avena'])
business_results_frame

         abril
carne     1000
huevos     600
jamon      600
lechuga    900
avena     1000